==================
prefix operator
==================

!true

---

(source_file
  (expr_stmt
    (prefix_expr
      (bool_literal))))

==================
postfix operator
==================

foo++

---

(source_file
  (expr_stmt
    (postfix_expr
      (name
        (identifier)))))

==================
binary operator
==================

1 + 2

---

(source_file
  (expr_stmt
    (binary_expr
      (dec_literal)
      (dec_literal))))


==================
member-call operator
==================

foo.operator +()

---

(source_file
  (expr_stmt
    (call_expr
      (member_access_expr
        (name
            (identifier))
        (name
          (operator_name))))))
